--------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Dropbox\Classes\ECO 395M Data mining and statisical learning\eco395m_team_awesome\final project\data\data_AEJ_deming_HeadStart.log
  log type:  text
 opened on:  11 May 2019, 18:31:37

. # delimit ;
delimiter now ;
. use data_Deming_2008_0217.dta, clear;

. *NLSY codes missing values as negatives - so drop all non-answers;
. foreach var of varlist ChildID- hhID {;
  2.         replace `var'=. if `var'<0;
  3. };
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. *First create rules that establish sample eligibility;
. *Rule is 5 years old by 1990, so that they will be 19 by 2004;
. *Next restrict the sample to families with at least 2 age-eligible children;
. *Finally restrict to families where at least one (but not all) children were in Head Start;
. ********************************************************************************************
> *I create 3 sets of variables that define preschool participation. The first simply uses   
> *the age variable and excludes those with any missing data. The second substitutes the PPVT
> *age (ie age at test) when the original variable is unavailable, and also substitutes past 
> *or future age variables from other survey years (plus or minus 24 months). The third is   
> *the most restrictive definition. It codes inconsistent or missing responses across years  
> *as zeros, as well as for children for whom mothers report "3 months or less" participation
> *in the program. The variables are coded HS1, HS2, HS3 and Pre1, Pre2, Pre3. In general    
> *different rules have very little impact on the estimates. I use #2 in the paper.          
> ********************************************************************************************
> 
> *Replace missing age values with PPVT Age or age reported from the nearest survey year instead;
.  local years "86 88 90 92 94 96 98 100 102 104";

. foreach y of local years {;
  2.         gen Age2_Mo`y'=Age_Mo`y';
  3.         replace Age2_Mo`y'=PPVTAge`y' if Age2_Mo`y'==.;
  4. };
(6,216 missing values generated)
(15 real changes made)
(4,907 missing values generated)
(23 real changes made)
(3,799 missing values generated)
(2 real changes made)
(4,224 missing values generated)
(0 real changes made)
(3,612 missing values generated)
(3 real changes made)
(3,350 missing values generated)
(2 real changes made)
(3,079 missing values generated)
(13 real changes made)
(3,149 missing values generated)
(2 real changes made)
(3,372 missing values generated)
(14 real changes made)
(3,204 missing values generated)
(9 real changes made)

. replace Age2_Mo86= Age2_Mo88-24 if  Age2_Mo86==. &  Age2_Mo88>=25 & Age2_Mo88!=.;
(352 real changes made)

. replace Age2_Mo88= Age2_Mo86+24 if  Age2_Mo88==. & Age2_Mo86!=.;
(227 real changes made)

. replace Age2_Mo88= Age2_Mo90-24 if  Age2_Mo88==. &  Age2_Mo90>=25 & Age2_Mo90!=.;
(97 real changes made)

. replace Age2_Mo90= Age2_Mo88+24 if  Age2_Mo90==. & Age2_Mo88!=.;
(305 real changes made)

. replace Age2_Mo90= Age2_Mo92-24 if  Age2_Mo90==. &  Age2_Mo92>=25 & Age2_Mo92!=.;
(85 real changes made)

. replace Age2_Mo92= Age2_Mo90+24 if  Age2_Mo92==. & Age2_Mo90!=.;
(1,589 real changes made)

. replace Age2_Mo92= Age2_Mo94-24 if  Age2_Mo92==. &  Age2_Mo94>=25 & Age2_Mo94!=.;
(47 real changes made)

. replace Age2_Mo94= Age2_Mo92+24 if  Age2_Mo94==. & Age2_Mo92!=.;
(1,682 real changes made)

. replace Age2_Mo94= Age2_Mo96-24 if  Age2_Mo94==. &  Age2_Mo96>=25 & Age2_Mo96!=.;
(25 real changes made)

. replace Age2_Mo96= Age2_Mo94+24 if  Age2_Mo96==. & Age2_Mo94!=.;
(1,896 real changes made)

. replace Age2_Mo96= Age2_Mo98-24 if  Age2_Mo96==. &  Age2_Mo98>=25 & Age2_Mo98!=.;
(40 real changes made)

. replace Age2_Mo98= Age2_Mo96+24 if  Age2_Mo98==. & Age2_Mo96!=.;
(2,024 real changes made)

. replace Age2_Mo98= Age2_Mo100-24 if  Age2_Mo98==. &  Age2_Mo100>=25 & Age2_Mo100!=.;
(57 real changes made)

. replace Age2_Mo100= Age2_Mo98+24 if  Age2_Mo100==. & Age2_Mo98!=.;
(2,405 real changes made)

. replace Age2_Mo100= Age2_Mo102-24 if  Age2_Mo100==. &  Age2_Mo102>=25 & Age2_Mo102!=.;
(18 real changes made)

. replace Age2_Mo102= Age2_Mo100+24 if  Age2_Mo102==. & Age2_Mo100!=.;
(2,752 real changes made)

. replace Age2_Mo102= Age2_Mo104-24 if  Age2_Mo102==. &  Age2_Mo104>=25 & Age2_Mo104!=.;
(26 real changes made)

. replace Age2_Mo104= Age2_Mo102+24 if  Age2_Mo104==. & Age2_Mo102!=.;
(2,678 real changes made)

. *Create age in years (rather than months) variable*;
. foreach x of local years {;
  2.         gen Age_Yr`x'=0 if Age_Mo`x'<12;
  3.         gen Age2_Yr`x'=0 if Age2_Mo`x'<12;
  4. };
(10,863 missing values generated)
(10,624 missing values generated)
(10,882 missing values generated)
(10,853 missing values generated)
(10,965 missing values generated)
(10,943 missing values generated)
(11,106 missing values generated)
(11,092 missing values generated)
(11,180 missing values generated)
(11,170 missing values generated)
(11,247 missing values generated)
(11,239 missing values generated)
(11,282 missing values generated)
(11,257 missing values generated)
(11,357 missing values generated)
(11,353 missing values generated)
(11,421 missing values generated)
(11,418 missing values generated)
(11,448 missing values generated)
(11,448 missing values generated)

. foreach x of local years {;
  2.         forvalues y = 1(1)37 {;
  3.                 replace Age_Yr`x'=`y' if Age_Mo`x'>=12*`y' & Age_Mo`x'<(12*`y')+12;
  4.                 replace Age2_Yr`x'=`y' if Age2_Mo`x'>=12*`y' & Age2_Mo`x'<(12*`y')+12;
  5.         };
  6. };
(634 real changes made)
(653 real changes made)
(614 real changes made)
(629 real changes made)
(619 real changes made)
(632 real changes made)
(618 real changes made)
(636 real changes made)
(511 real changes made)
(520 real changes made)
(471 real changes made)
(484 real changes made)
(350 real changes made)
(359 real changes made)
(297 real changes made)
(303 real changes made)
(214 real changes made)
(224 real changes made)
(168 real changes made)
(176 real changes made)
(90 real changes made)
(94 real changes made)
(39 real changes made)
(40 real changes made)
(17 real changes made)
(20 real changes made)
(4 real changes made)
(4 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(552 real changes made)
(569 real changes made)
(598 real changes made)
(632 real changes made)
(656 real changes made)
(693 real changes made)
(585 real changes made)
(616 real changes made)
(618 real changes made)
(648 real changes made)
(603 real changes made)
(632 real changes made)
(555 real changes made)
(580 real changes made)
(503 real changes made)
(532 real changes made)
(360 real changes made)
(386 real changes made)
(309 real changes made)
(330 real changes made)
(233 real changes made)
(246 real changes made)
(194 real changes made)
(207 real changes made)
(120 real changes made)
(128 real changes made)
(55 real changes made)
(58 real changes made)
(25 real changes made)
(27 real changes made)
(7 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(562 real changes made)
(575 real changes made)
(585 real changes made)
(616 real changes made)
(553 real changes made)
(585 real changes made)
(588 real changes made)
(619 real changes made)
(673 real changes made)
(713 real changes made)
(585 real changes made)
(612 real changes made)
(615 real changes made)
(650 real changes made)
(612 real changes made)
(639 real changes made)
(543 real changes made)
(582 real changes made)
(514 real changes made)
(534 real changes made)
(359 real changes made)
(384 real changes made)
(315 real changes made)
(336 real changes made)
(253 real changes made)
(265 real changes made)
(192 real changes made)
(202 real changes made)
(124 real changes made)
(130 real changes made)
(56 real changes made)
(57 real changes made)
(28 real changes made)
(28 real changes made)
(7 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(435 real changes made)
(443 real changes made)
(470 real changes made)
(548 real changes made)
(469 real changes made)
(565 real changes made)
(495 real changes made)
(621 real changes made)
(481 real changes made)
(606 real changes made)
(504 real changes made)
(625 real changes made)
(547 real changes made)
(695 real changes made)
(501 real changes made)
(626 real changes made)
(502 real changes made)
(649 real changes made)
(517 real changes made)
(629 real changes made)
(456 real changes made)
(586 real changes made)
(423 real changes made)
(525 real changes made)
(307 real changes made)
(379 real changes made)
(261 real changes made)
(338 real changes made)
(188 real changes made)
(257 real changes made)
(156 real changes made)
(199 real changes made)
(96 real changes made)
(120 real changes made)
(46 real changes made)
(60 real changes made)
(23 real changes made)
(26 real changes made)
(3 real changes made)
(5 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(367 real changes made)
(371 real changes made)
(367 real changes made)
(376 real changes made)
(436 real changes made)
(449 real changes made)
(456 real changes made)
(539 real changes made)
(476 real changes made)
(581 real changes made)
(484 real changes made)
(617 real changes made)
(463 real changes made)
(594 real changes made)
(510 real changes made)
(633 real changes made)
(550 real changes made)
(699 real changes made)
(495 real changes made)
(621 real changes made)
(499 real changes made)
(652 real changes made)
(506 real changes made)
(629 real changes made)
(451 real changes made)
(584 real changes made)
(419 real changes made)
(523 real changes made)
(323 real changes made)
(393 real changes made)
(251 real changes made)
(333 real changes made)
(187 real changes made)
(260 real changes made)
(162 real changes made)
(205 real changes made)
(93 real changes made)
(117 real changes made)
(44 real changes made)
(57 real changes made)
(24 real changes made)
(28 real changes made)
(3 real changes made)
(5 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(258 real changes made)
(267 real changes made)
(314 real changes made)
(324 real changes made)
(355 real changes made)
(371 real changes made)
(342 real changes made)
(367 real changes made)
(429 real changes made)
(452 real changes made)
(453 real changes made)
(554 real changes made)
(453 real changes made)
(575 real changes made)
(465 real changes made)
(621 real changes made)
(467 real changes made)
(607 real changes made)
(503 real changes made)
(643 real changes made)
(545 real changes made)
(702 real changes made)
(462 real changes made)
(606 real changes made)
(514 real changes made)
(678 real changes made)
(481 real changes made)
(613 real changes made)
(427 real changes made)
(572 real changes made)
(407 real changes made)
(521 real changes made)
(288 real changes made)
(369 real changes made)
(250 real changes made)
(338 real changes made)
(183 real changes made)
(258 real changes made)
(147 real changes made)
(194 real changes made)
(86 real changes made)
(108 real changes made)
(41 real changes made)
(55 real changes made)
(22 real changes made)
(25 real changes made)
(3 real changes made)
(5 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(196 real changes made)
(200 real changes made)
(212 real changes made)
(225 real changes made)
(271 real changes made)
(281 real changes made)
(301 real changes made)
(321 real changes made)
(346 real changes made)
(371 real changes made)
(351 real changes made)
(374 real changes made)
(426 real changes made)
(457 real changes made)
(444 real changes made)
(550 real changes made)
(457 real changes made)
(582 real changes made)
(474 real changes made)
(624 real changes made)
(474 real changes made)
(622 real changes made)
(487 real changes made)
(639 real changes made)
(513 real changes made)
(684 real changes made)
(460 real changes made)
(613 real changes made)
(515 real changes made)
(685 real changes made)
(484 real changes made)
(617 real changes made)
(418 real changes made)
(576 real changes made)
(394 real changes made)
(510 real changes made)
(283 real changes made)
(366 real changes made)
(245 real changes made)
(339 real changes made)
(169 real changes made)
(249 real changes made)
(140 real changes made)
(194 real changes made)
(82 real changes made)
(110 real changes made)
(37 real changes made)
(53 real changes made)
(19 real changes made)
(23 real changes made)
(3 real changes made)
(5 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(123 real changes made)
(125 real changes made)
(179 real changes made)
(191 real changes made)
(178 real changes made)
(195 real changes made)
(211 real changes made)
(230 real changes made)
(252 real changes made)
(279 real changes made)
(269 real changes made)
(296 real changes made)
(352 real changes made)
(389 real changes made)
(322 real changes made)
(362 real changes made)
(405 real changes made)
(457 real changes made)
(434 real changes made)
(554 real changes made)
(433 real changes made)
(574 real changes made)
(431 real changes made)
(617 real changes made)
(440 real changes made)
(608 real changes made)
(440 real changes made)
(607 real changes made)
(518 real changes made)
(716 real changes made)
(453 real changes made)
(613 real changes made)
(470 real changes made)
(666 real changes made)
(461 real changes made)
(620 real changes made)
(414 real changes made)
(590 real changes made)
(401 real changes made)
(529 real changes made)
(287 real changes made)
(382 real changes made)
(232 real changes made)
(335 real changes made)
(188 real changes made)
(273 real changes made)
(149 real changes made)
(202 real changes made)
(95 real changes made)
(123 real changes made)
(39 real changes made)
(58 real changes made)
(26 real changes made)
(29 real changes made)
(4 real changes made)
(7 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(72 real changes made)
(75 real changes made)
(115 real changes made)
(127 real changes made)
(112 real changes made)
(123 real changes made)
(186 real changes made)
(203 real changes made)
(176 real changes made)
(203 real changes made)
(189 real changes made)
(219 real changes made)
(237 real changes made)
(277 real changes made)
(271 real changes made)
(313 real changes made)
(324 real changes made)
(374 real changes made)
(330 real changes made)
(389 real changes made)
(380 real changes made)
(452 real changes made)
(410 real changes made)
(554 real changes made)
(414 real changes made)
(574 real changes made)
(436 real changes made)
(639 real changes made)
(423 real changes made)
(609 real changes made)
(458 real changes made)
(634 real changes made)
(460 real changes made)
(678 real changes made)
(441 real changes made)
(623 real changes made)
(458 real changes made)
(665 real changes made)
(440 real changes made)
(630 real changes made)
(398 real changes made)
(584 real changes made)
(373 real changes made)
(519 real changes made)
(266 real changes made)
(374 real changes made)
(226 real changes made)
(336 real changes made)
(172 real changes made)
(260 real changes made)
(140 real changes made)
(202 real changes made)
(78 real changes made)
(114 real changes made)
(35 real changes made)
(52 real changes made)
(23 real changes made)
(28 real changes made)
(4 real changes made)
(6 real changes made)
(2 real changes made)
(2 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(45 real changes made)
(45 real changes made)
(52 real changes made)
(52 real changes made)
(75 real changes made)
(78 real changes made)
(117 real changes made)
(129 real changes made)
(125 real changes made)
(130 real changes made)
(174 real changes made)
(186 real changes made)
(187 real changes made)
(213 real changes made)
(194 real changes made)
(223 real changes made)
(240 real changes made)
(282 real changes made)
(288 real changes made)
(325 real changes made)
(321 real changes made)
(375 real changes made)
(334 real changes made)
(381 real changes made)
(386 real changes made)
(443 real changes made)
(460 real changes made)
(592 real changes made)
(424 real changes made)
(585 real changes made)
(423 real changes made)
(626 real changes made)
(429 real changes made)
(612 real changes made)
(464 real changes made)
(643 real changes made)
(461 real changes made)
(673 real changes made)
(455 real changes made)
(636 real changes made)
(454 real changes made)
(656 real changes made)
(452 real changes made)
(629 real changes made)
(395 real changes made)
(574 real changes made)
(374 real changes made)
(513 real changes made)
(264 real changes made)
(366 real changes made)
(231 real changes made)
(338 real changes made)
(152 real changes made)
(239 real changes made)
(131 real changes made)
(193 real changes made)
(79 real changes made)
(114 real changes made)
(38 real changes made)
(52 real changes made)
(16 real changes made)
(21 real changes made)
(3 real changes made)
(6 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. *Create dummy for sample eligibility, by year*;
. *Minimum of 2 siblings age 54 months or more, in each sample year*;
. *Want to account in some way for the fact that people are surveyed at different times of the year*;
. *But also don't want to include siblings who subsequently enroll*;
. *So I chose 4 years, 6 months - these kids are almost certainly too old to enroll if they are not already in the program*;
. *Estimates in the paper are not sensitive to this rule*;
. foreach y in 86 88 90 {;
  2.         bysort MotherID: egen Elig1_`y'=count(Age_Mo`y') if Age_Mo`y'>47 & Age_Mo`y'!=.;
  3.         bysort MotherID: egen Elig2_`y'=count(Age2_Mo`y') if Age2_Mo`y'>47 & Age2_Mo`y'!=.;
  4.         replace Elig1_`y'=0 if Elig1_`y'==1;
  5.         replace Elig1_`y'=1 if Elig1_`y'>1 & Elig1_`y'!=.;
  6.         replace Elig1_`y'=0 if Elig1_`y'!=1;
  7.         replace Elig2_`y'=0 if Elig2_`y'==1;
  8.         replace Elig2_`y'=1 if Elig2_`y'>1 & Elig2_`y'!=.;
  9.         replace Elig2_`y'=0 if Elig2_`y'!=1;
 10. };
(8690 missing values generated)
(8609 missing values generated)
(1,113 real changes made)
(1,667 real changes made)
(8,690 real changes made)
(1,146 real changes made)
(1,715 real changes made)
(8,609 real changes made)
(7301 missing values generated)
(7071 missing values generated)
(1,314 real changes made)
(2,855 real changes made)
(7,301 real changes made)
(1,371 real changes made)
(3,028 real changes made)
(7,071 real changes made)
(6004 missing values generated)
(5710 missing values generated)
(1,322 real changes made)
(4,144 real changes made)
(6,004 real changes made)
(1,402 real changes made)
(4,358 real changes made)
(5,710 real changes made)

. *Exclude small number of kids who died prior to eligibility*;
. foreach x in 86 88 90 {;
  2.         gen byte Dead`x'=Res`x'==8;
  3.         replace Elig1_`x'=. if Dead`x'==1;
  4.         replace Elig2_`x'=. if Dead`x'==1;
  5. };
(84 real changes made, 84 to missing)
(84 real changes made, 84 to missing)
(97 real changes made, 97 to missing)
(97 real changes made, 97 to missing)
(100 real changes made, 100 to missing)
(100 real changes made, 100 to missing)

. gen Deceased=Res104==8;

. drop Dead*;

. *Create Head Start, Other Preschool, and No Preschool categories*;
. *Create variables equal to one if respondent ever indicated enrollment in HS or other preschools in 1988-1992* ;
. *Question was not asked in 1986*;
. foreach y in 1 2 {;
  2.         egen HS`y'_90=rowmax(Ever_HS88 Ever_HS90) if Elig`y'_90==1;
  3.         egen Pre`y'_90=rowmax(Ever_Preschool88 Ever_Preschool90) if Elig`y'_90==1;
  4.         foreach x in 90 {;
  5.                 replace HS`y'_`x'=0 if Elig`y'_`x'==1 & HS`y'_`x'!=1;
  6.                 replace Pre`y'_`x'=0 if Elig`y'_`x'==1 & Pre`y'_`x'!=1;
  7.                         *I code "yes" responses to both HS and preschool as Head Start (Rule 3 does it the other way)*;
.                 replace Pre`y'_`x'=0 if HS`y'_`x'==1;
  8.                 gen byte None`y'_`x'=Elig`y'_`x'==1 ;
  9.                 replace None`y'_`x'=. if Elig`y'_`x'==0;
 10.                 replace None`y'_`x'=0 if (HS`y'_`x'==1 | Pre`y'_`x'==1);
 11.         };
 12. };
(8026 missing values generated)
(8026 missing values generated)
(628 real changes made)
(628 real changes made)
(650 real changes made)
(7,298 real changes made, 7,298 to missing)
(1,974 real changes made)
(7947 missing values generated)
(7947 missing values generated)
(763 real changes made)
(763 real changes made)
(655 real changes made)
(7,084 real changes made, 7,084 to missing)
(2,001 real changes made)

. *Alternative participation definition - code inconsistent responses across years as missing or zeros*;
. *Also code as zero those who report being in Head Start for less than 3 months*;
. foreach x in 90 {;
  2.         foreach y in HS Pre None {;
  3.                 gen `y'3_`x'=`y'2_`x';
  4.         };
  5. };
(7,184 missing values generated)
(7,184 missing values generated)
(7,084 missing values generated)

. replace HS3_90=0 if (Ever_HS88==1 & Ever_HS90==0) | (HowLong_HS88==1 | HowLong_HS90==1) & HS3_90!=.;
(77 real changes made)

. replace Pre3_90=0 if (Ever_Preschool88==1 & Ever_Preschool90==0) & Pre3_90!=.;
(38 real changes made)

. replace None3_90=1 if HS3_90==0 & Pre3_90==0;
(108 real changes made)

. *Create dummy for "fixed effects" sample - families where HS participation varies across siblings*;
. foreach y in 86 88 90 {;
  2.         bysort MotherID: egen Num1Elig`y'=count(Age_Mo`y') if Age_Mo`y'>47 & Age_Mo`y'!=.;
  3.         bysort MotherID: egen Num2Elig`y'=count(Age2_Mo`y') if Age2_Mo`y'>47 & Age2_Mo`y'!=.;
  4.         bysort MotherID: egen Num3Elig`y'=count(Age2_Mo`y') if Age2_Mo`y'>47 & Age2_Mo`y'!=.;
  5.         *This creates a count of eligible siblings per household*;
. };
(8690 missing values generated)
(8609 missing values generated)
(8609 missing values generated)
(7301 missing values generated)
(7071 missing values generated)
(7071 missing values generated)
(6004 missing values generated)
(5710 missing values generated)
(5710 missing values generated)

. foreach x in 1 2 3 {;
  2.         foreach y in 90 {;
  3.                 *For each family, count the number of kids in each category (HS, Pre, None)*
>                 *Then set equal to missing if all kids in the family are in the same category (and thus ineligible)*;
.                                 bysort MotherID: egen temp= count(ChildID) if HS`x'_`y'==1;
  4.                 replace temp=. if Num`x'Elig`y'==temp;
  5.                 bysort MotherID: egen temp2= count(ChildID) if Pre`x'_`y'==1;
  6.                 replace temp2=. if Num`x'Elig`y'==temp2;
  7.                 bysort MotherID: egen temp3= count(ChildID) if None`x'_`y'==1;
  8.                 replace temp3=. if Num`x'Elig`y'==temp3;
  9.                 *Now create dummy vars with counts*;
.                 gen byte HS`x'_FE`y'=1 if temp!=.;
 10.                 gen byte Pre`x'_FE`y'=1 if temp2!=.;
 11.                 gen byte None`x'_FE`y'=1 if temp3!=.;
 12.                 replace HS`x'_FE`y'=0 if (Pre`x'_FE`y'==1 | None`x'_FE`y'==1);
 13.                 replace Pre`x'_FE`y'=0 if (HS`x'_FE`y'==1 | None`x'_FE`y'==1);
 14.                 replace None`x'_FE`y'=0 if (HS`x'_FE`y'==1 | Pre`x'_FE`y'==1);
 15.                 drop temp temp2 temp3;
 16.         };
 17. };
(10592 missing values generated)
(391 real changes made, 391 to missing)
(10374 missing values generated)
(586 real changes made, 586 to missing)
(9372 missing values generated)
(1,237 real changes made, 1,237 to missing)
(10,983 missing values generated)
(10,960 missing values generated)
(10,609 missing values generated)
(1,371 real changes made)
(1,348 real changes made)
(997 real changes made)
(10583 missing values generated)
(393 real changes made, 393 to missing)
(10356 missing values generated)
(592 real changes made, 592 to missing)
(9185 missing values generated)
(1,402 real changes made, 1,402 to missing)
(10,976 missing values generated)
(10,948 missing values generated)
(10,587 missing values generated)
(1,405 real changes made)
(1,377 real changes made)
(1,016 real changes made)
(10653 missing values generated)
(328 real changes made, 328 to missing)
(10394 missing values generated)
(575 real changes made, 575 to missing)
(9077 missing values generated)
(1,485 real changes made, 1,485 to missing)
(10,981 missing values generated)
(10,969 missing values generated)
(10,562 missing values generated)
(1,409 real changes made)
(1,397 real changes made)
(990 real changes made)

. gen byte PreK=1 if HS2_90==1;
(10,583 missing values generated)

. replace PreK=2 if Pre2_90==1;
(1,114 real changes made)

. replace PreK=3 if None2_90==1;
(2,285 real changes made)

. gen byte PreK_FE=1 if HS2_FE90==1;
(10,976 missing values generated)

. replace PreK_FE=2 if Pre2_FE90==1;
(522 real changes made)

. replace PreK_FE=3 if None2_FE90==1;
(883 real changes made)

. *END SAMPLE ELIGIBILITY SECTION*;
. ********************************************************************************************
> *Now I create the covariates in Tables 1 and 2 and in the regressions in the rest of the
> *paper.
> ********************************************************************************************
> ;
. gen byte Hispanic=Race_Child==1;

. gen byte Black=Race_Child==2;

. gen byte White=Race_Child==3;

. gen byte NonBlack=Race_Child!=2 & Race_Child!=.;

. *Generate basic demographic variables in Table 1*
> *Permanent Income, Mother<HS, Mother some college, Maternal AFQT, Grandmother's Education*
> 
> *Create yearly income in constant 2004 dollars, as well as "permanent income" measure*;
. replace NetFamInc78=NetFamInc78*2.82;
(8,901 real changes made)

. replace NetFamInc79=NetFamInc79*2.54;
(8,852 real changes made)

. replace NetFamInc80=NetFamInc80*2.24;
(8,745 real changes made)

. replace NetFamInc81=NetFamInc81*2.03;
(8,712 real changes made)

. replace NetFamInc82=NetFamInc82*1.90;
(8,885 real changes made)

. replace NetFamInc83=NetFamInc83*1.85;
(8,885 real changes made)

. replace NetFamInc84=NetFamInc84*1.78;
(8,794 real changes made)

. replace NetFamInc85=NetFamInc85*1.71;
(8,805 real changes made)

. replace NetFamInc86=NetFamInc86*1.68;
(8,609 real changes made)

. replace NetFamInc87=NetFamInc87*1.62;
(8,503 real changes made)

. replace NetFamInc88=NetFamInc88*1.55;
(8,732 real changes made)

. replace NetFamInc89=NetFamInc89*1.48;
(8,620 real changes made)

. replace NetFamInc90=NetFamInc90*1.41;
(7,977 real changes made)

. replace NetFamInc91=NetFamInc91*1.35;
(7,696 real changes made)

. replace NetFamInc92=NetFamInc92*1.31;
(7,450 real changes made)

. replace NetFamInc93=NetFamInc93*1.27;
(7,218 real changes made)

. replace NetFamInc95=NetFamInc95*1.21;
(7,041 real changes made)

. replace NetFamInc97=NetFamInc97*1.15;
(7,048 real changes made)

. replace NetFamInc99=NetFamInc99*1.10;
(6,681 real changes made)

. replace NetFamInc101=NetFamInc101*1.04;
(6,546 real changes made)

. egen PermInc=rowmean( NetFamInc78 NetFamInc79 NetFamInc80 NetFamInc81 NetFamInc82 NetFamInc83 NetFamInc84 
>                             NetFamInc85 NetFamInc86 NetFamInc87 NetFamInc88 NetFamInc89 NetFamInc90 NetFamInc91 
>                             NetFamInc92 NetFamInc93 NetFamInc95 NetFamInc97 NetFamInc99 NetFamInc101 NetFamInc103);
(42 missing values generated)

. gen lnPermInc=ln(PermInc);
(44 missing values generated)

. egen PermInc_std=std(PermInc), mean(0) std(1);
(42 missing values generated)

. foreach var of varlist HighGrade_Moth* {;
  2.         replace `var'=. if `var'==95;
  3. };
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. egen MothED=rowmax( HighGrade_Moth*);
(51 missing values generated)

. gen byte MomDropout=MothED<12;

. replace MomDropout=. if MothED==.;
(51 real changes made, 51 to missing)

. gen byte MomHS=MothED==12;

. replace MomHS=. if MothED==.;
(51 real changes made, 51 to missing)

. gen byte MomSomeColl=MothED>=13 & MothED!=.;

. replace MomSomeColl=. if MothED==.;
(51 real changes made, 51 to missing)

. *Create age-adjusted maternal AFQT score*;
. gen AgeAFQT=AFQT_Pct81_REV;
(639 missing values generated)

. replace AgeAFQT=AgeAFQT*(35.60881/28.79544) if Age_Mom79==14;
(805 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/32.86273) if Age_Mom79==15;
(1,315 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/32.86273) if Age_Mom79==16;
(1,406 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/36.3544) if Age_Mom79==17;
(1,329 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/33.45777) if Age_Mom79==18;
(1,468 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/36.84) if Age_Mom79==19;
(1,450 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/41.84536) if Age_Mom79==20;
(1,358 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/40.95177) if Age_Mom79==21;
(1,410 real changes made)

. replace AgeAFQT=AgeAFQT*(35.60881/42.82069) if Age_Mom79==22;
(290 real changes made)

. egen AgeAFQT_std=std(AgeAFQT), mean(0) std(1);
(639 missing values generated)

. *For a small number of mothers, AFQT score is missing - impute missings for use as a covariate later*;
. impute AgeAFQT_std Black Hispanic Age_Moth_Birth, gen(impAFQT_std);
  5.57% (639) observations imputed

. *But use non-imputed values only for Table 1*
> 
> *LIST OF VARIABLES FOR TABLE 1 - PermInc MomDropout MomBA AgeAFQT_std HighGrade_GMom79*;
. foreach x in Black NonBlack {;
  2. tabexport       PermInc 
>                 MomDropout 
>                 MomSomeColl 
>                 AgeAFQT_std 
>                 HighGrade_GMom79 if `x'==1 using table1-`x'.txt, replace s(mean sd count) by(PreK) f(%9.2f);
  3. tabexport       PermInc 
>                 MomDropout 
>                 MomSomeColl 
>                 AgeAFQT_std 
>                 HighGrade_GMom79 if `x'==1 using table1-`x'FE.txt, replace s(mean sd count) by(PreK_FE) f(%9.2f);
  4. };

     +----------------------------------------------------------------------+
     | PreK   _stats    PermInc   MomDro~t   MomSom~l   AgeAFQ~d   HighG~79 |
     |----------------------------------------------------------------------|
  1. |    1     mean   24005.34       0.33       0.31      -0.75       9.71 |
  2. |    1       sd   16103.12       0.47       0.46       0.49       2.56 |
  3. |    1    count     415.00     415.00     415.00     415.00     415.00 |
  4. |    2     mean   32469.71       0.20       0.50      -0.51      10.88 |
  5. |    2       sd   21939.33       0.40       0.50       0.72       2.68 |
     |----------------------------------------------------------------------|
  6. |    2    count     249.00     249.00     249.00     249.00     249.00 |
  7. |    3     mean   25979.74       0.38       0.28      -0.68       9.70 |
  8. |    3       sd   18496.10       0.49       0.45       0.60       2.87 |
  9. |    3    count     551.00     551.00     551.00     551.00     551.00 |
     +----------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
     | PreK_FE   _stats    PermInc   MomDro~t   MomSom~l   AgeAFQ~d   HighG~79 |
     |-------------------------------------------------------------------------|
  1. |       1     mean   26009.88       0.39       0.32      -0.77       9.82 |
  2. |       1       sd   19558.85       0.49       0.47       0.48       2.59 |
  3. |       1    count     206.00     206.00     206.00     206.00     206.00 |
  4. |       2     mean   28939.76       0.27       0.42      -0.63      10.13 |
  5. |       2       sd   22853.43       0.45       0.50       0.66       2.76 |
     |-------------------------------------------------------------------------|
  6. |       2    count     144.00     144.00     144.00     144.00     144.00 |
  7. |       3     mean   24164.23       0.37       0.30      -0.76       9.98 |
  8. |       3       sd   16313.85       0.48       0.46       0.56       2.67 |
  9. |       3    count     259.00     259.00     259.00     259.00     259.00 |
     +-------------------------------------------------------------------------+

     +----------------------------------------------------------------------+
     | PreK   _stats    PermInc   MomDro~t   MomSom~l   AgeAFQ~d   HighG~79 |
     |----------------------------------------------------------------------|
  1. |    1     mean   26553.41       0.51       0.22      -0.44       8.53 |
  2. |    1       sd   19555.12       0.50       0.41       0.73       3.50 |
  3. |    1    count     364.00     364.00     364.00     364.00     364.00 |
  4. |    2     mean   52130.32       0.18       0.41       0.23      10.62 |
  5. |    2       sd   34577.26       0.38       0.49       0.85       2.92 |
     |----------------------------------------------------------------------|
  6. |    2    count     745.00     745.00     745.00     745.00     745.00 |
  7. |    3     mean   35591.96       0.42       0.23      -0.21       9.34 |
  8. |    3       sd   23459.65       0.49       0.42       0.86       3.36 |
  9. |    3    count    1374.00    1374.00    1374.00    1374.00    1374.00 |
     +----------------------------------------------------------------------+

     +-------------------------------------------------------------------------+
     | PreK_FE   _stats    PermInc   MomDro~t   MomSom~l   AgeAFQ~d   HighG~79 |
     |-------------------------------------------------------------------------|
  1. |       1     mean   27560.38       0.53       0.16      -0.48       8.51 |
  2. |       1       sd   22902.14       0.50       0.37       0.70       3.42 |
  3. |       1    count     229.00     229.00     229.00     229.00     229.00 |
  4. |       2     mean   41881.92       0.25       0.31       0.02      10.09 |
  5. |       2       sd   22403.11       0.43       0.46       0.83       3.19 |
     |-------------------------------------------------------------------------|
  6. |       2    count     315.00     315.00     315.00     315.00     315.00 |
  7. |       3     mean   35900.77       0.41       0.22      -0.20       9.54 |
  8. |       3       sd   23600.25       0.49       0.41       0.82       3.34 |
  9. |       3    count     510.00     510.00     510.00     510.00     510.00 |
     +-------------------------------------------------------------------------+

. *Generate within-sibling difference covariates in Table 2*;
. *Reside in same household, preexisting health limitation, low birthweight, Attrited from LT sample*;
. *Reside in same household as mother - code zero if they did not reside with mom in any eligible year*;
. forvalues x = 79(1)90 {;
  2.         gen byte MomHH`x'=1 if Res`x'==1;
  3.         replace MomHH`x'=0 if Res`x'!=1 & Res`x'!=.;
  4. };
(10,376 missing values generated)
(236 real changes made)
(9,942 missing values generated)
(239 real changes made)
(9,364 missing values generated)
(257 real changes made)
(8,614 missing values generated)
(196 real changes made)
(7,984 missing values generated)
(298 real changes made)
(7,301 missing values generated)
(279 real changes made)
(7,092 missing values generated)
(274 real changes made)
(6,538 missing values generated)
(313 real changes made)
(5,950 missing values generated)
(336 real changes made)
(5,344 missing values generated)
(401 real changes made)
(4,789 missing values generated)
(469 real changes made)
(4,370 missing values generated)
(552 real changes made)

. gen Res_0to3=MomHH90 if Age2_Yr104==14;
(10,912 missing values generated)

. egen temp1=rowmin(MomHH89-MomHH90) if Age2_Yr104==15;
(10909 missing values generated)

. egen temp2=rowmin(MomHH88-MomHH90) if Age2_Yr104==16;
(10858 missing values generated)

. egen temp3=rowmin(MomHH87-MomHH90) if Age2_Yr104==17;
(10867 missing values generated)

. egen temp4=rowmin(MomHH86-MomHH89) if Age2_Yr104==18;
(10841 missing values generated)

. egen temp5=rowmin(MomHH85-MomHH88) if Age2_Yr104==19;
(10807 missing values generated)

. egen temp6=rowmin(MomHH84-MomHH87) if Age2_Yr104==20;
(10840 missing values generated)

. egen temp7=rowmin(MomHH83-MomHH86) if Age2_Yr104==21;
(10816 missing values generated)

. egen temp8=rowmin(MomHH82-MomHH85) if Age2_Yr104==22;
(10846 missing values generated)

. egen temp9=rowmin(MomHH81-MomHH84) if Age2_Yr104==23;
(10904 missing values generated)

. egen temp10=rowmin(MomHH80-MomHH83) if Age2_Yr104==24;
(10964 missing values generated)

. egen temp11=rowmin(MomHH79-MomHH82) if Age2_Yr104==25;
(11108 missing values generated)

. egen temp12=rowmin(MomHH79-MomHH81) if Age2_Yr104==26;
(11134 missing values generated)

. egen temp13=rowmin(MomHH79-MomHH80) if Age2_Yr104==27;
(11232 missing values generated)

. forvalues x = 1(1)13 {;
  2.         replace Res_0to3=temp`x' if Age2_Yr104==`x'+14;
  3. };
(561 real changes made)
(612 real changes made)
(603 real changes made)
(629 real changes made)
(663 real changes made)
(630 real changes made)
(654 real changes made)
(624 real changes made)
(566 real changes made)
(506 real changes made)
(362 real changes made)
(336 real changes made)
(238 real changes made)

. replace Res_0to3=MomHH79 if Age2_Yr104==28;
(192 real changes made)

. drop temp* MomHH*;

. *Health Limitations that are reported prior to age 5*;
. gen Ear86=.;
(11,470 missing values generated)

. gen Blood86=.;
(11,470 missing values generated)

. gen Epilepsy86=.;
(11,470 missing values generated)

. local Health     "Brain 
>                         Hyper 
>                         Asthma 
>                         Resp 
>                         Speech 
>                         Deaf 
>                         Blind 
>                         Disturb 
>                         Allergy 
>                         Crippled 
>                         Retard 
>                         Heart 
>                         Nerve 
>                         Ear 
>                         Blood 
>                         Epilepsy 
>                         OtherLim";

. foreach x of local Health {;
  2.         forvalues y = 86(2)90 {;
  3.                 gen temp`x'`y'=.;
  4.                 replace temp`x'`y'=1 if `x'`y'>0 & `x'`y'!=.;
  5.                 *replace temp`x'`y'=0 if HealthCond`y'!=. & temp`x'`y'!=1*;
.         };
  6.         egen `x'=rowmax(temp`x'*);
  7.         gen `x'_before=.;
  8.         forvalues y =86(2)90  {;
  9.                 replace `x'_before=1 if temp`x'`y'==1 & Age2_Mo`y'<60;
 10.         };
 11.         drop temp*;
 12. };
(11,470 missing values generated)
(9 real changes made)
(11,470 missing values generated)
(17 real changes made)
(11,470 missing values generated)
(18 real changes made)
(11432 missing values generated)
(11,470 missing values generated)
(2 real changes made)
(4 real changes made)
(2 real changes made)
(11,470 missing values generated)
(12 real changes made)
(11,470 missing values generated)
(16 real changes made)
(11,470 missing values generated)
(30 real changes made)
(11422 missing values generated)
(11,470 missing values generated)
(3 real changes made)
(2 real changes made)
(1 real change made)
(11,470 missing values generated)
(83 real changes made)
(11,470 missing values generated)
(130 real changes made)
(11,470 missing values generated)
(152 real changes made)
(11208 missing values generated)
(11,470 missing values generated)
(46 real changes made)
(39 real changes made)
(29 real changes made)
(11,470 missing values generated)
(18 real changes made)
(11,470 missing values generated)
(18 real changes made)
(11,470 missing values generated)
(26 real changes made)
(11411 missing values generated)
(11,470 missing values generated)
(9 real changes made)
(6 real changes made)
(14 real changes made)
(11,470 missing values generated)
(23 real changes made)
(11,470 missing values generated)
(14 real changes made)
(11,470 missing values generated)
(25 real changes made)
(11417 missing values generated)
(11,470 missing values generated)
(9 real changes made)
(7 real changes made)
(6 real changes made)
(11,470 missing values generated)
(17 real changes made)
(11,470 missing values generated)
(17 real changes made)
(11,470 missing values generated)
(16 real changes made)
(11431 missing values generated)
(11,470 missing values generated)
(8 real changes made)
(2 real changes made)
(3 real changes made)
(11,470 missing values generated)
(9 real changes made)
(11,470 missing values generated)
(13 real changes made)
(11,470 missing values generated)
(7 real changes made)
(11444 missing values generated)
(11,470 missing values generated)
(4 real changes made)
(3 real changes made)
(3 real changes made)
(11,470 missing values generated)
(7 real changes made)
(11,470 missing values generated)
(14 real changes made)
(11,470 missing values generated)
(11 real changes made)
(11444 missing values generated)
(11,470 missing values generated)
(3 real changes made)
(1 real change made)
(0 real changes made)
(11,470 missing values generated)
(37 real changes made)
(11,470 missing values generated)
(35 real changes made)
(11,470 missing values generated)
(53 real changes made)
(11361 missing values generated)
(11,470 missing values generated)
(20 real changes made)
(13 real changes made)
(17 real changes made)
(11,470 missing values generated)
(41 real changes made)
(11,470 missing values generated)
(30 real changes made)
(11,470 missing values generated)
(24 real changes made)
(11390 missing values generated)
(11,470 missing values generated)
(31 real changes made)
(12 real changes made)
(10 real changes made)
(11,470 missing values generated)
(9 real changes made)
(11,470 missing values generated)
(10 real changes made)
(11,470 missing values generated)
(16 real changes made)
(11443 missing values generated)
(11,470 missing values generated)
(2 real changes made)
(3 real changes made)
(2 real changes made)
(11,470 missing values generated)
(21 real changes made)
(11,470 missing values generated)
(22 real changes made)
(11,470 missing values generated)
(15 real changes made)
(11425 missing values generated)
(11,470 missing values generated)
(12 real changes made)
(10 real changes made)
(5 real changes made)
(11,470 missing values generated)
(5 real changes made)
(11,470 missing values generated)
(2 real changes made)
(11,470 missing values generated)
(2 real changes made)
(11462 missing values generated)
(11,470 missing values generated)
(1 real change made)
(0 real changes made)
(0 real changes made)
(11,470 missing values generated)
(0 real changes made)
(11,470 missing values generated)
(28 real changes made)
(11,470 missing values generated)
(28 real changes made)
(11418 missing values generated)
(11,470 missing values generated)
(0 real changes made)
(17 real changes made)
(16 real changes made)
(11,470 missing values generated)
(0 real changes made)
(11,470 missing values generated)
(8 real changes made)
(11,470 missing values generated)
(6 real changes made)
(11459 missing values generated)
(11,470 missing values generated)
(0 real changes made)
(3 real changes made)
(2 real changes made)
(11,470 missing values generated)
(0 real changes made)
(11,470 missing values generated)
(27 real changes made)
(11,470 missing values generated)
(21 real changes made)
(11430 missing values generated)
(11,470 missing values generated)
(0 real changes made)
(13 real changes made)
(7 real changes made)
(11,470 missing values generated)
(53 real changes made)
(11,470 missing values generated)
(109 real changes made)
(11,470 missing values generated)
(0 real changes made)
(11319 missing values generated)
(11,470 missing values generated)
(33 real changes made)
(39 real changes made)
(0 real changes made)

. egen HealthCond_before=rowmax(*before);
(11109 missing values generated)

. replace HealthCond_before=0 if HealthCond_before!=1;
(11,109 real changes made)

. *Some children are too old and so pre-Head Start info is unavailable for them*;
. replace HealthCond_before=. if Res_0to3==.;
(3,736 real changes made, 3,736 to missing)

. *Low Birthweight*;
. gen int Low_BW=BirthWeight<88;

. replace Low_BW=. if BirthWeight==.;
(1,206 real changes made, 1,206 to missing)

. gen int VLow_BW=BirthWeight<53;

. replace VLow_BW=. if BirthWeight==.;
(1,206 real changes made, 1,206 to missing)

. *Attrition - If respondent disappears from sample before age 19*;
. gen Attrit=0 if YA_LastInterview==2004;
(6,446 missing values generated)

. replace Attrit=1 if YA_LastInterview!=2004 & YA_LastInterview!=.;
(610 real changes made)

. *Count those who attrit before 2004 but after they turn 19 as being in the sample*;
. replace Attrit=0 if Attrit==1 & YA_LastInterview==2002 & Age2_Yr102>=19;
(242 real changes made)

. replace Attrit=0 if Attrit==1 & YA_LastInterview==2000 & Age2_Yr100>=19;
(66 real changes made)

. foreach x in 94 96 98 {;
  2.         replace Attrit=0 if Attrit==1 & YA_LastInterview==19`x' & Age2_Yr`x'>=19;
  3. };
(3 real changes made)
(18 real changes made)
(6 real changes made)

. *Create dummies for estimation sample*;
. foreach x in 1 2 3 {;
  2.         gen Sample90_`x'=1 if HS`x'_FE90!=. & SampleID!=12 & Attrit==0 & Age2_Yr104>=19;
  3.         *Also include those who are 18 but have their 19th birthday in the first 7 months of 2004, for the school year*;
.         replace Sample90_`x'=1 if HS`x'_FE90!=. & Attrit==0 & Sample90_`x'!=1 & DOB_Yr_Child==1985 & DOB_Mo_Child<8;
  4. };
(10,264 missing values generated)
(26 real changes made)
(10,246 missing values generated)
(27 real changes made)
(10,247 missing values generated)
(29 real changes made)

. *Separate kids that are in Head Start at age 3 from later*;
. gen byte Three=(Age_1stHS88<=3 | Age_1stHS90<=3);

. gen byte NotThree=(Age_1stHS88>3 & Age_1stHS88!=.) | (Age_1stHS90>3 & Age_1stHS90!=.);

. gen HS_3=1 if Three==1;
(11,074 missing values generated)

. replace HS_3=2 if NotThree==1;
(743 real changes made)

. replace HS_3=0 if HS_3==.;
(10,364 real changes made)

. gen PreK_FE_3=PreK_FE;
(9,571 missing values generated)

. replace PreK_FE_3=0 if PreK_FE_3==1 & HS_3==1;
(139 real changes made)

. tabstat PermInc MomDropout MomSomeColl AgeAFQT_std Hispanic Black White, by(PreK_FE_3) s(mean semean);

Summary statistics: mean, se(mean)
  by categories of: PreK_FE_3 

PreK_FE_3 |   PermInc  MomDro~t  MomSom~l  AgeAFQ~d  Hispanic     Black     White
----------+----------------------------------------------------------------------
        0 |  24209.51  .4388489  .2374101 -.6670405  .2230216  .5467626  .2302158
          |  1310.805  .0422433  .0362206  .0537527  .0354355  .0423763  .0358354
----------+----------------------------------------------------------------------
        1 |  27174.59  .5014085  .2140845 -.6096389  .2253521  .4309859   .343662
          |  1174.959  .0265746  .0218011  .0349012  .0222066  .0263203  .0252422
----------+----------------------------------------------------------------------
        2 |  38518.29  .2624521  .3409962  -.205467   .183908  .3122605  .5038314
          |    1175.3  .0192753  .0207682  .0375163  .0169727  .0203026  .0219048
----------+----------------------------------------------------------------------
        3 |  32159.18   .396376  .2480181 -.4067844  .1947905  .3306908  .4745187
          |  793.8389  .0164703  .0145416  .0271285  .0133353  .0158413   .016814
----------+----------------------------------------------------------------------
    Total |  32393.47  .3823065   .266456 -.4093343  .1995787  .3601896  .4402317
          |  555.3252  .0111543  .0101479  .0183194  .0091742   .011019  .0113945
---------------------------------------------------------------------------------

. *Log Income Ages 0-3, Log Income at Age 3*;
. forvalues x = 78(1)90 {;
  2.         gen Income`x'=NetFamInc`x';
  3. };
(2,517 missing values generated)
(2,564 missing values generated)
(2,613 missing values generated)
(2,664 missing values generated)
(2,460 missing values generated)
(2,497 missing values generated)
(2,602 missing values generated)
(2,580 missing values generated)
(2,761 missing values generated)
(2,858 missing values generated)
(2,626 missing values generated)
(2,715 missing values generated)
(3,378 missing values generated)

. gen Income_0to3=Income90 if Age2_Yr104==14;
(11,030 missing values generated)

. egen temp1=rowmean(Income89-Income90) if Age2_Yr104==15;
(10946 missing values generated)

. egen temp2=rowmean(Income88-Income90) if Age2_Yr104==16;
(10884 missing values generated)

. egen temp3=rowmean(Income87-Income90) if Age2_Yr104==17;
(10884 missing values generated)

. egen temp4=rowmean(Income86-Income89) if Age2_Yr104==18;
(10846 missing values generated)

. egen temp5=rowmean(Income85-Income88) if Age2_Yr104==19;
(10822 missing values generated)

. egen temp6=rowmean(Income84-Income87) if Age2_Yr104==20;
(10850 missing values generated)

. egen temp7=rowmean(Income83-Income86) if Age2_Yr104==21;
(10829 missing values generated)

. egen temp8=rowmean(Income82-Income85) if Age2_Yr104==22;
(10855 missing values generated)

. egen temp9=rowmean(Income81-Income84) if Age2_Yr104==23;
(10913 missing values generated)

. egen temp10=rowmean(Income80-Income83) if Age2_Yr104==24;
(10969 missing values generated)

. egen temp11=rowmean(Income79-Income82) if Age2_Yr104==25;
(11112 missing values generated)

. egen temp12=rowmean(Income79-Income81) if Age2_Yr104==26;
(11147 missing values generated)

. egen temp13=rowmean(Income78-Income80) if Age2_Yr104==27;
(11239 missing values generated)

. egen temp14=rowmean(Income78-Income79) if Age2_Yr104==28;
(11297 missing values generated)

. forvalues x = 1(1)14 {;
  2.         replace Income_0to3=temp`x' if Age2_Yr104==`x'+14;
  3. };
(524 real changes made)
(586 real changes made)
(586 real changes made)
(624 real changes made)
(648 real changes made)
(620 real changes made)
(641 real changes made)
(615 real changes made)
(557 real changes made)
(501 real changes made)
(358 real changes made)
(323 real changes made)
(231 real changes made)
(173 real changes made)

. replace Income_0to3=Income78 if Age2_Yr104==29;
(82 real changes made)

. drop temp* Income78-Income90;

. gen LogInc_0to3=ln(Income_0to3);
(3,985 missing values generated)

. gen IncAt3=NetFamInc78 if Age2_Yr104==29;
(11,388 missing values generated)

. replace IncAt3=NetFamInc79 if Age2_Yr104==28;
(147 real changes made)

. replace IncAt3=NetFamInc80 if Age2_Yr104==27;
(185 real changes made)

. replace IncAt3=NetFamInc81 if Age2_Yr104==26;
(286 real changes made)

. replace IncAt3=NetFamInc82 if Age2_Yr104==25;
(311 real changes made)

. replace IncAt3=NetFamInc83 if Age2_Yr104==24;
(426 real changes made)

. replace IncAt3=NetFamInc84 if Age2_Yr104==23;
(473 real changes made)

. replace IncAt3=NetFamInc85 if Age2_Yr104==22;
(516 real changes made)

. replace IncAt3=NetFamInc86 if Age2_Yr104==21;
(521 real changes made)

. replace IncAt3=NetFamInc87 if Age2_Yr104==20;
(509 real changes made)

. replace IncAt3=NetFamInc88 if Age2_Yr104==19;
(544 real changes made)

. replace IncAt3=NetFamInc89 if Age2_Yr104==18;
(524 real changes made)

. replace IncAt3=NetFamInc90 if Age2_Yr104==17;
(418 real changes made)

. gen LogIncAt3=ln(IncAt3);
(6,589 missing values generated)

. *First Born and Gender*;
. gen byte FirstBorn=BirthOrder==1;

. replace FirstBorn=. if BirthOrder==.;
(44 real changes made, 44 to missing)

. gen byte Male=Sex_Child==1;

. *PPVT score at age 3*;
. gen PPVTat3=PPVT_Raw86 if (PPVTAge86>=36 & PPVTAge86<47);
(10,998 missing values generated)

. replace PPVTat3=PPVT_Raw88 if (PPVTAge88>=36 & PPVTAge88<47) & PPVTat3==.;
(512 real changes made)

. replace PPVTat3=PPVT_Raw90 if (PPVTAge90>=36 & PPVTAge90<47) & PPVTat3==.;
(0 real changes made)

. *HOME score*;
. egen HOME_Pct_0to3= rowmean(HOME_Pct86 HOME_Pct88) if Age2_Yr104<=19 & Age2_Yr104>=16;
(9189 missing values generated)

. egen temp1 = rowmean(HOME_Pct88 HOME_Pct90) if Age2_Yr104<=15 & Age2_Yr104>=14;
(10641 missing values generated)

. replace HOME_Pct_0to3=temp1 if Age2_Yr104<=15 & Age2_Yr104>=14;
(829 real changes made)

. replace HOME_Pct_0to3=HOME_Pct86 if Age2_Yr104>=20 & Age2_Yr104<=21;
(1,138 real changes made)

. drop temp1;

. *Mom worked 0-3, Avg. wks. stopped work before birth (cond. on having a job), Mom hrs worked/wk 0-1*;
. egen temp=rowmean(Moth_HrsWorked*Before);
(5243 missing values generated)

. gen Moth_HrsWorked_BefBirth=temp/13;
(5,243 missing values generated)

. drop temp;

. egen Moth_HrsWorked_0to3=rowmean(Moth_HrsWorked*Qtr);
(3793 missing values generated)

. egen Moth_HrsWorked_Avg_0to3=rowmean(Moth_HrsWorked*Avg);
(3819 missing values generated)

. egen Moth_HrsWorked_0to1=rowmean(Moth_HrsWorked_1_Avg Moth_HrsWorked_2_Avg Moth_HrsWorked_3_Avg Moth_HrsWorked_4_Avg);
(5986 missing values generated)

. *Father and/or Grandmother present, ages 0-3*;
. egen Father_HH_0to3= rowmean(Father_HH90 Father_HH92 Father_HH93) if Age2_Yr104==14;
(10895 missing values generated)

. egen temp1 =rowmean(Father_HH89 Father_HH90) if Age2_Yr104==15;
(10915 missing values generated)

. egen temp2 =rowmean(Father_HH88 Father_HH89 Father_HH90) if Age2_Yr104==16;
(10866 missing values generated)

. egen temp3= rowmean(Father_HH87 Father_HH88 Father_HH89 Father_HH90) if Age2_Yr104==17;
(10872 missing values generated)

. egen temp4= rowmean(Father_HH86 Father_HH87 Father_HH88 Father_HH89) if Age2_Yr104==18;
(10851 missing values generated)

. egen temp5= rowmean(Father_HH85 Father_HH86 Father_HH87 Father_HH88) if Age2_Yr104==19;
(10815 missing values generated)

. egen temp6= rowmean(Father_HH84 Father_HH85 Father_HH86 Father_HH87) if Age2_Yr104==20;
(10851 missing values generated)

. egen temp7= rowmean(Father_HH84 Father_HH85 Father_HH86) if Age2_Yr104==21;
(10834 missing values generated)

. egen temp8= rowmean(Father_HH84 Father_HH85) if Age2_Yr104==22;
(10863 missing values generated)

. replace Father_HH_0to3=temp1 if Age2_Yr104==15 ;
(555 real changes made)

. replace Father_HH_0to3=temp2 if Age2_Yr104==16 ;
(604 real changes made)

. replace Father_HH_0to3=temp3 if Age2_Yr104==17 ;
(598 real changes made)

. replace Father_HH_0to3=temp4 if Age2_Yr104==18;
(619 real changes made)

. replace Father_HH_0to3=temp5 if Age2_Yr104==19;
(655 real changes made)

. replace Father_HH_0to3=temp6 if Age2_Yr104==20;
(619 real changes made)

. replace Father_HH_0to3=temp7 if Age2_Yr104==21;
(636 real changes made)

. replace Father_HH_0to3=temp8 if Age2_Yr104==22;
(607 real changes made)

. replace Father_HH_0to3=Father_HH84 if Age2_Yr104==23;
(524 real changes made)

. drop temp*;

. forvalues x = 79(1)90 {;
  2.         gen byte GMom`x'=1 if Grandmother`x'==1;
  3.         replace GMom`x'=0 if Grandmother`x'!=1 & Grandmother`x'!=.;
  4. };
(3,976 missing values generated)
(3,873 real changes made)
(4,830 missing values generated)
(4,390 real changes made)
(5,857 missing values generated)
(5,501 real changes made)
(6,758 missing values generated)
(6,330 real changes made)
(7,500 missing values generated)
(7,195 real changes made)
(8,283 missing values generated)
(7,909 real changes made)
(9,019 missing values generated)
(8,158 real changes made)
(9,556 missing values generated)
(8,562 real changes made)
(9,947 missing values generated)
(8,851 real changes made)
(10,280 missing values generated)
(9,070 real changes made)
(10,400 missing values generated)
(9,455 real changes made)
(10,524 missing values generated)
(9,412 real changes made)

. gen GMom_0to3=GMom90 if Age2_Yr104==14;
(10,901 missing values generated)

. egen temp1=rowmean(GMom89-GMom90) if Age2_Yr104==15;
(10905 missing values generated)

. egen temp2=rowmean(GMom88-GMom90) if Age2_Yr104==16;
(10858 missing values generated)

. egen temp3=rowmean(GMom87-GMom90) if Age2_Yr104==17;
(10863 missing values generated)

. egen temp4=rowmean(GMom86-GMom89) if Age2_Yr104==18;
(10835 missing values generated)

. egen temp5=rowmean(GMom85-GMom88) if Age2_Yr104==19;
(10803 missing values generated)

. egen temp6=rowmean(GMom84-GMom87) if Age2_Yr104==20;
(10840 missing values generated)

. egen temp7=rowmean(GMom83-GMom86) if Age2_Yr104==21;
(10816 missing values generated)

. egen temp8=rowmean(GMom82-GMom85) if Age2_Yr104==22;
(10846 missing values generated)

. egen temp9=rowmean(GMom81-GMom84) if Age2_Yr104==23;
(10901 missing values generated)

. egen temp10=rowmean(GMom80-GMom83) if Age2_Yr104==24;
(10960 missing values generated)

. egen temp11=rowmean(GMom79-GMom82) if Age2_Yr104==25;
(11104 missing values generated)

. egen temp12=rowmean(GMom79-GMom81) if Age2_Yr104==26;
(11132 missing values generated)

. egen temp13=rowmean(GMom79-GMom80) if Age2_Yr104==27;
(11231 missing values generated)

. forvalues x = 1(1)13 {;
  2.         replace GMom_0to3=temp`x' if Age2_Yr104==`x'+14;
  3. };
(565 real changes made)
(612 real changes made)
(607 real changes made)
(635 real changes made)
(667 real changes made)
(630 real changes made)
(654 real changes made)
(624 real changes made)
(569 real changes made)
(510 real changes made)
(366 real changes made)
(338 real changes made)
(239 real changes made)

. replace GMom_0to3=GMom79 if Age2_Yr104==28;
(193 real changes made)

. drop temp* GMom79-GMom90;

. *Mom Care 0-3, Relative Care 0-3, Nonrelative care 0-3*;
. rename ChildCare_1stYr ChildCare_1_Yr;

. rename ChildCare_Type_1stYr ChildCare_Type_1_Yr;

. rename ChildCare_2ndYr ChildCare_2_Yr;

. rename ChildCare_Type_2ndYr ChildCare_Type_2_Yr;

. rename ChildCare_3rdYr ChildCare_3_Yr;

. rename ChildCare_Type_3rdYr ChildCare_Type_3_Yr;

. foreach y in 1 2 3 {;
  2.         gen RelCare_`y'_Yr=1 if  ChildCare_Type_`y'_Yr!=. &  ChildCare_Type_`y'_Yr<=10;
  3.         replace RelCare_`y'_Yr=0 if  ChildCare_`y'_Yr!=. & RelCare_`y'_Yr!=1;
  4.         gen NonRelCare_`y'_Yr=1 if  ChildCare_Type_`y'_Yr!=. &  ChildCare_Type_`y'_Yr>10;
  5.         replace NonRelCare_`y'_Yr=0 if  ChildCare_`y'_Yr!=. & NonRelCare_`y'_Yr!=1;
  6.         gen MomCare_`y'_Yr=1 if  (RelCare_`y'_Yr==0 &  NonRelCare_`y'_Yr==0);
  7.         replace MomCare_`y'_Yr=0 if  MomCare_`y'_Yr!=1 & ( RelCare_`y'_Yr!=. &  NonRelCare_`y'_Yr!=.);
  8. };
(9,493 missing values generated)
(7,866 real changes made)
(9,649 missing values generated)
(8,022 real changes made)
(5,425 missing values generated)
(3,798 real changes made)
(9,558 missing values generated)
(7,661 real changes made)
(9,186 missing values generated)
(7,289 real changes made)
(6,093 missing values generated)
(4,196 real changes made)
(9,742 missing values generated)
(7,414 real changes made)
(8,790 missing values generated)
(6,462 real changes made)
(6,736 missing values generated)
(4,408 real changes made)

. egen RelCare=rowmean( RelCare*);
(1216 missing values generated)

. egen NonRelCare=rowmean( NonRelCare*);
(1216 missing values generated)

. egen MomCare=rowmean(MomCare*);
(1216 missing values generated)

. *Mom smoked, Mom drank, Breastfed, Doctor's visit in last 3 months, Dentist ever, Weight Change during preg*;
. gen byte Alc_BefBirth= Freq_Alc_BefBirth>=3 & Freq_Alc_BefBirth!=.;

. foreach x in Doctor Dentist {;
  2.         egen `x'_temp= rowmean(Last_`x'86 Last_`x'88) if Age2_Yr104<=19 & Age2_Yr104>=16;
  3.         egen temp1=rowmean(Last_`x'88 Last_`x'90) if Age2_Yr104<=15 & Age2_Yr104>=14;
  4.         replace `x'_temp=temp1 if Age2_Yr104<=15 & Age2_Yr104>=14;
  5.         replace `x'_temp=Last_`x'86 if Age2_Yr104>=20 & Age2_Yr104<=21;
  6.         drop temp1;
  7. };
(9122 missing values generated)
(10575 missing values generated)
(895 real changes made)
(1,175 real changes made)
(10098 missing values generated)
(11340 missing values generated)
(130 real changes made)
(1,033 real changes made)

. gen Doctor_0to3=1 if Doctor_temp<=2;
(8,998 missing values generated)

. replace Doctor_0to3=0 if Doctor_temp>2 & Doctor_temp!=.;
(1,946 real changes made)

. gen Dentist_0to3=1 if Dentist_temp<7;
(10,896 missing values generated)

. replace Dentist_0to3=0 if Dentist_temp==7;
(1,961 real changes made)

. drop Doctor_temp Dentist_temp;

. *UNCHANGED - Moth_Smoke_BefBirth, Breastfed, Moth_WeightChange*;
. *Illness in 1st year, Premature birth, Birthweight, Priv Health Insurance 0-3, Medicaid 0-3*;
. gen byte Premature=BornEarlyorLate==1;

. replace Premature=. if BornOnTime==.;
(1,332 real changes made, 1,332 to missing)

. foreach x in Insurance Medicaid {;
  2.         egen `x'_0to3= rowmean(`x'86 `x'88) if Age2_Yr104<=19 & Age2_Yr104>=16;
  3.         egen temp1=rowmean(`x'88 `x'90) if Age2_Yr104<=15 & Age2_Yr104>=14;
  4.         replace `x'_0to3=temp1 if Age2_Yr104<=15 & Age2_Yr104>=14;
  5.         replace `x'_0to3=`x'86 if Age2_Yr104>=20 & Age2_Yr104<=21;
  6.         drop temp1;
  7. };
(9122 missing values generated)
(10558 missing values generated)
(912 real changes made)
(1,178 real changes made)
(9122 missing values generated)
(10557 missing values generated)
(913 real changes made)
(1,176 real changes made)

. gen logBW=ln(BirthWeight);
(1,209 missing values generated)

. *LIST OF VARIABLE NAMES FOR TABLE 2*;
. *Attrit Res_0to3 HealthCond_before logBW VLow_BW LogInc_0to3 LogIncAt3 FirstBorn Male Age2_Yr104*
> *PPVTAge3 HOME_Pct_0to3 Moth_HrsWorked_BefBirth Moth_HrsWorked_0to1* 
> *Father_HH_0to3 GMom_0to3 MomCare RelCare NonRelCare* 
> *Breastfed Moth_Smoke_BefBirth Alc_BefBirth Doctor_0to3 Dentist_0to3 Moth_WeightChange* 
> *Illness_1stYr Premature Insurance_0to3 Medicaid_0to3 PreTreatIndex*
> 
> *Create index of covariates for summary test*;
. unab Covariates:        Res_0to3 HealthCond_before logBW LogInc_0to3 LogIncAt3 
>                         FirstBorn Male Age2_Yr104 HOME_Pct_0to3 Moth_HrsWorked_BefBirth 
>                         Moth_HrsWorked_0to1 Father_HH_0to3 GMom_0to3 MomCare RelCare NonRelCare 
>                         Moth_Smoke_BefBirth Alc_BefBirth Breastfed Doctor_0to3 Dentist_0to3 Moth_WeightChange 
>                         Illness_1stYr Premature Insurance_0to3 Medicaid_0to3;

. foreach x of local Covariates {;
  2. egen `x'_CV=std(`x') if Sample90_2==1, mean(0) std(1);
  3. };
(10283 missing values generated)
(10283 missing values generated)
(10244 missing values generated)
(10284 missing values generated)
(10477 missing values generated)
(10219 missing values generated)
(10219 missing values generated)
(10219 missing values generated)
(11043 missing values generated)
(11093 missing values generated)
(11091 missing values generated)
(10731 missing values generated)
(10280 missing values generated)
(10226 missing values generated)
(10226 missing values generated)
(10226 missing values generated)
(10284 missing values generated)
(10219 missing values generated)
(10236 missing values generated)
(11040 missing values generated)
(11069 missing values generated)
(10324 missing values generated)
(10295 missing values generated)
(10295 missing values generated)
(11039 missing values generated)
(11039 missing values generated)

. *Reverse sign so that positive=good outcomes*;
. foreach var of varlist  HealthCond_before_CV Male_CV Age2_Yr104_CV GMom_0to3_CV MomCare_CV RelCare_CV 
>                                 Moth_Smoke_BefBirth_CV Alc_BefBirth_CV  Illness_1stYr_CV Premature_CV Medicaid_0to3_CV {;
  2.                                 replace `var'=-`var';
  3. };
(1,187 real changes made)
(1,251 real changes made)
(1,251 real changes made)
(1,190 real changes made)
(1,244 real changes made)
(1,244 real changes made)
(1,186 real changes made)
(1,251 real changes made)
(1,175 real changes made)
(1,175 real changes made)
(431 real changes made)

. egen temp=rowmean(*_CV) if Sample90_2==1;
(10219 missing values generated)

. egen PreTreatIndex=std(temp), mean(0) std(1);
(10219 missing values generated)

. drop temp *_CV;

. *Run regs for Table 2*;
. *Sample is slightly different for Attrit and PPVTat3 than the rest of the covariates*;
. xtset MotherID;
       panel variable:  MotherID (unbalanced)

. xtreg Attrit HS2_FE90 Pre2_FE90 
>         if HS2_FE90!=. & SampleID!=12 & (Age2_Yr104>=19 | (DOB_Yr_Child==1985 & DOB_Mo_Child<9)), fe vce(cluster MotherID);

Fixed-effects (within) regression               Number of obs     =      1,314
Group variable: MotherID                        Number of groups  =        586

R-sq:                                           Obs per group:
     within  = 0.0045                                         min =          1
     between = 0.0057                                         avg =        2.2
     overall = 0.0000                                         max =          6

                                                F(2,585)          =       1.88
corr(u_i, Xb)  = -0.0855                        Prob > F          =     0.1531

                             (Std. Err. adjusted for 586 clusters in MotherID)
------------------------------------------------------------------------------
             |               Robust
      Attrit |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    HS2_FE90 |   .0218973   .0134598     1.63   0.104    -.0045381    .0483328
   Pre2_FE90 |  -.0078506   .0163427    -0.48   0.631     -.039948    .0242469
       _cons |   .0363144   .0070942     5.12   0.000     .0223812    .0502477
-------------+----------------------------------------------------------------
     sigma_u |  .17401822
     sigma_e |  .16854783
         rho |  .51596481   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test HS2_FE90=Pre2_FE90;

 ( 1)  HS2_FE90 - Pre2_FE90 = 0

       F(  1,   585) =    2.88
            Prob > F =    0.0902

. estadd scalar Difference = r(p);

added scalar:
         e(Difference) =  .09020683

. estimates store Attrit;

. estout Attrit using Table2-Rev.txt, varlabels(_cons None) 
>                                                 starlevels(* 0.10 ** 0.05 *** 0.01) 
>                                                 stardrop(_cons) 
>                                                 cells(b(star fmt(3)) 
>                                                 se(par([ ]) fmt(3))) 
>                                                 stats(Difference N, star(Difference) 
>                                                 fmt(3 0) 
>                                                 labels("P-value of Diff" "Sample Size")) 
>                                                 label append;
(output written to Table2-Rev.txt)

. drop _est_Attrit;

. xtreg PPVTat3 HS2_FE90 Pre2_FE90 Male FirstBorn Age2_Mo90 if Sample90_2==1, fe vce(cluster MotherID);

Fixed-effects (within) regression               Number of obs     =        195
Group variable: MotherID                        Number of groups  =        183

R-sq:                                           Obs per group:
     within  = 0.4104                                         min =          1
     between = 0.0026                                         avg =        1.1
     overall = 0.0013                                         max =          2

                                                F(5,182)          =       1.28
corr(u_i, Xb)  = -0.4354                        Prob > F          =     0.2737

                             (Std. Err. adjusted for 183 clusters in MotherID)
------------------------------------------------------------------------------
             |               Robust
     PPVTat3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    HS2_FE90 |   2.239855   4.817862     0.46   0.643    -7.266192     11.7459
   Pre2_FE90 |  -7.164487   4.121654    -1.74   0.084    -15.29686    .9678841
        Male |  -2.337553    2.53759    -0.92   0.358    -7.344431    2.669325
   FirstBorn |   11.19318    6.86625     1.63   0.105    -2.354509    24.74087
   Age2_Mo90 |  -.1582331   .1240654    -1.28   0.204    -.4030246    .0865584
       _cons |   34.29995   8.683832     3.95   0.000     17.16602    51.43388
-------------+----------------------------------------------------------------
     sigma_u |  13.872861
     sigma_e |  7.8276886
         rho |   .7585112   (fraction of variance due to u_i)
------------------------------------------------------------------------------

. test HS2_FE90=Pre2_FE90;

 ( 1)  HS2_FE90 - Pre2_FE90 = 0

       F(  1,   182) =    3.33
            Prob > F =    0.0698

. estadd scalar Difference = r(p);

added scalar:
         e(Difference) =  .0698222

. estimates store PPVTat3;

. estout PPVTat3 using Table2-Rev.txt,    varlabels(_cons None) 
>                                                         starlevels(* 0.10 ** 0.05 *** 0.01) 
>                                                         stardrop(_cons) 
>                                                         cells(b(star fmt(3)) se(par([ ]) fmt(3))) 
>                                                         stats(Difference N, star(Difference) 
>                                                         fmt(3 0) 
>                                                         labels("P-value of Diff" "Sample Size")) 
>                                                         label append;
(output written to Table2-Rev.txt)

. drop _est_PPVTat3;

. *Now loop over all the covariates for respondents in the estimation sample*;
. unab Covariates:        Res_0to3 HealthCond_before VLow_BW logBW LogInc_0to3 LogIncAt3 FirstBorn Male 
>                         Age2_Yr104 HOME_Pct_0to3 Moth_HrsWorked_BefBirth Moth_HrsWorked_0to1 Father_HH_0to3 
>                         GMom_0to3 MomCare RelCare NonRelCare Moth_Smoke_BefBirth Alc_BefBirth Breastfed 
>                         Doctor_0to3 Dentist_0to3 Moth_WeightChange Illness_1stYr Premature Insurance_0to3 
>                         Medicaid_0to3 PreTreatIndex;

. foreach y of local Covariates {;
  2.         xtreg `y' HS2_FE90 Pre2_FE90 if Sample90_2==1, fe vce(cluster MotherID);
  3.         test HS2_FE90=Pre2_FE90;
  4.         estadd scalar Difference = r(p);
  5.         estimates store `y';
  6.         estout `y' using Table2-Rev.txt,        varlabels(_cons None) 
>                                                         starlevels(* 0.10 ** 0.05 *** 0.01) 
>                                                         stardrop(_cons) 
>                                                         cells(b(star fmt(3)) se(par([ ]) fmt(3))) 
>                                                         stats(Difference N, star(Difference) 
>                                                         fmt(3 0) 
>                                                         labels("P-value of Diff" "Sample Size")) 
>                                                         label append;
  7.         drop _est_`y';
  8. };
